noless-zz/esp8266-led-strip-clock/src/main.cpp
/*
 * ESP8266 LED Strip Clock
 * 60-LED NeoPixel time display with NTP sync and timezone auto-detection
 * Features: WiFi captive portal, firmware OTA upload, time sync, color blending
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ESPAsyncTCP.h>
#include <DNSServer.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <ESP8266mDNS.h>
#include <Adafruit_NeoPixel.h>
#include <EEPROM.h>
#include <Updater.h>
#include <time.h>
#include <sys/time.h>
#include <WiFiUDP.h>

#ifndef NUM_LEDS
#define NUM_LEDS 60
#endif
#ifndef LED_PIN
#define LED_PIN D4
#endif

// Build timestamp - compiler generates this automatically
const char* FW_VERSION_BASE = "2.0.0";
const char* FW_BUILD_TIME = __DATE__ " " __TIME__;
// AP_SSID is built at runtime with last 3 MAC bytes, e.g. "LED-Clock-A1B2C3"
String AP_SSID_STR;
const char* AP_SSID = nullptr; // set in setup() after WiFi.macAddress() is available
const char* AP_PASS = "";
const char* OTA_PASS = "admin123";
const char* NTP_SERVER = "pool.ntp.org";
const byte DNS_PORT = 53;
const int MAX_SCAN_CACHE = 30;

// Display modes
enum DisplayMode {
  DISPLAY_SOLID = 0,        // Rainbow orbit with HMS markers
  DISPLAY_SIMPLE = 1,       // Clean 3-LED HMS (red/green/blue)
  DISPLAY_PULSE = 2,        // Subtle pulse with HMS
  DISPLAY_BINARY = 3,       // Binary clock stretched to 60 LEDs
  DISPLAY_HOUR_MARKER = 4,  // Minute progress with hour beacon
  DISPLAY_FLAME = 5,        // Optimized flame effect with HMS
  DISPLAY_PASTEL = 6,       // Soft pastel HMS colors
  DISPLAY_NEON = 7,         // Bright neon HMS
  DISPLAY_COMET = 8,        // Animated HMS comet trails
  DISPLAY_MAX = 9
};

// EEPROM Layout
const int EEPROM_SIZE = 512;
const int EEPROM_MAGIC_ADDR = 0;
const int EEPROM_SSID_ADDR = 1;
const int EEPROM_PASS_ADDR = 65;
const int EEPROM_BRIGHTNESS_ADDR = 129;
const int EEPROM_TZ_OFFSET_ADDR = 130;
const int EEPROM_DISPLAY_MODE_ADDR = 134;
const int EEPROM_MODE_CFG_MAGIC_ADDR = 135;
const int EEPROM_RGBW_ADDR = 136;          // 1 byte: 1=RGBW, 0=RGB
const int EEPROM_REVERSED_ADDR = 137;      // 1 byte: 1=reversed, 0=normal
const int EEPROM_MODE_CFG_BASE_ADDR = 160; // 9 modes x 13 bytes = 117 bytes -> uses 160-276
// Debug remote logging (addr 279-298, after mode configs)
const int EEPROM_DBG_MAGIC_ADDR   = 279;   // 1 byte: magic 0xD8
const int EEPROM_DBG_ENABLED_ADDR = 280;   // 1 byte: 1=enabled
const int EEPROM_DBG_IP_ADDR      = 281;   // 16 bytes: null-terminated IP string
const int EEPROM_DBG_PORT_ADDR    = 297;   // 2 bytes: port (big-endian)
const uint8_t EEPROM_DBG_MAGIC    = 0xD8;
const uint8_t EEPROM_MODE_CFG_MAGIC = 0x5C;
const uint8_t EEPROM_MAGIC = 0xA7;
const int MAX_SSID_LEN = 32;
const int MAX_PASS_LEN = 64;

// Global state - LEDs
Adafruit_NeoPixel *ledStrip = nullptr;
uint8_t ledBrightness = 76;  // 30%
bool ledRgbw = false;        // false=RGB, true=RGBW
bool ledReversed = false;    // false=normal (0â†'59), true=reversed (59â†'0)
DisplayMode displayMode = DISPLAY_SOLID;
struct CRGB { uint8_t r, g, b; } leds[NUM_LEDS];

struct ModeDisplayConfig {
  uint8_t hourR, hourG, hourB;
  uint8_t minuteR, minuteG, minuteB;
  uint8_t secondR, secondG, secondB;
  uint8_t hourWidth;
  uint8_t minuteWidth;
  uint8_t secondWidth;
  uint8_t spectrum;
};

ModeDisplayConfig modeConfigs[DISPLAY_MAX];

// Web server
AsyncWebServer server(80);
DNSServer dnsServer;
bool mdnsStarted = false;

// WiFi state
struct ScanCacheEntry {
  String ssid;
  int32_t rssi = 0;
  int channel = -1;
  int enc = -1;
  bool hasBssid = false;
};
ScanCacheEntry scanCache[MAX_SCAN_CACHE];
int scanCacheCount = 0;
unsigned long scanCacheUpdatedAt = 0;

struct {
  bool active = false;
  bool connecting = false;
  bool success = false;
  String attemptedSsid;
  String error = "";
  unsigned long startedAt = 0;
  wl_status_t lastStatus = WL_DISCONNECTED;
} wifiConnect;

bool wifiConnected = false;
bool forceClockDisplay = false;   // show clock even before NTP
bool forceStatusDisplay = false;  // show boot animation even after NTP synced
String savedSsid;   // credentials loaded from EEPROM, used after AP is up
String savedPass;
unsigned long lastNtpSync = 0, lastTzCheck = 0;
struct { int32_t utcOffset; String name; bool autoDetected; } tz = {0, "UTC", true};
struct {
  String source = "ip-api.com";
  String status = "idle";
  String message = "not started";
  String responseSample = "";
  int httpCode = 0;
  unsigned long lastAttemptMs = 0;
  unsigned long lastSuccessMs = 0;
} tzDiag;

// OTA state
struct {
  bool inProgress = false;
  bool approved = false;
  bool lastSuccess = false;
  uint8_t lastErrorCode = 0;
  String lastErrorText = "";
  String lastFileName = "";
  uint32_t expectedBytes = 0;
  uint32_t writtenBytes = 0;
  unsigned long startedAt = 0;
  unsigned long finishedAt = 0;
} otaStatus;

// RTC memory boot record -- survives WDT/exception resets, cleared on power-cycle
struct BootRecord {
  uint32_t magic;       // RTC_BOOT_MAGIC when valid
  uint32_t uptime_s;    // last saved uptime in seconds (updated every 30s)
  uint32_t boot_count;  // incremented each reboot
};
#define RTC_BOOT_MAGIC 0xB007C10CUL
#define RTC_BOOT_SLOT  0  // offset 0 in user RTC memory (SDK reserves lower words)

// Remote UDP debug logging
bool debugRemoteEnabled = false;
String debugServerIp = "";
uint16_t debugServerPort = 7878;
WiFiUDP debugUdp;
String cachedBootInfo = "";      // captured in setup(), sent after WiFi connects
bool bootInfoSent = false;

// Forward declarations for display functions
void displayMode_Simple();
void displayMode_Pulse();
void displayMode_Pastel();
void displayMode_Binary();
void displayMode_HourMarker();
void displayMode_Neon();
void displayMode_Comet();
void displayMode_Flame();
void displayClock_Solid();
void setDefaultModeConfigs();
void loadModeConfigsFromEEPROM();
void saveModeConfigToEEPROM(uint8_t mode);
void saveDisplayModeToEEPROM();

// ============================================================================
// Remote Debug Logging
// ============================================================================

