noless-zz/esp8266-led-strip-clock/src/main.cpp
void debugLogf(const char* level, const char* tag, const char* fmt, ...) {
  char msg[256];
  va_list args;
  va_start(args, fmt);
  vsnprintf(msg, sizeof(msg), fmt, args);
  va_end(args);
  Serial.printf("[%lu][%s][%s] %s\n", millis(), level, tag, msg);
  if (!debugRemoteEnabled || !wifiConnected || debugServerIp.length() == 0) return;
  char packet[320];
  int plen = snprintf(packet, sizeof(packet), "[%lu][%s][%s] %s\n", millis(), level, tag, msg);
  debugUdp.beginPacket(debugServerIp.c_str(), debugServerPort);
  debugUdp.write((const uint8_t*)packet, (size_t)plen);
  debugUdp.endPacket();
}

#define DLOGI(tag, ...) debugLogf("INF", tag, __VA_ARGS__)
#define DLOGE(tag, ...) debugLogf("ERR", tag, __VA_ARGS__)
#define DLOGW(tag, ...) debugLogf("WRN", tag, __VA_ARGS__)

void captureBootInfo() {
  rst_info *ri = ESP.getResetInfoPtr();

  // Read RTC boot record (valid across WDT/exception resets, not power cycles)
  BootRecord br = {};
  bool rtcValid = ESP.rtcUserMemoryRead(RTC_BOOT_SLOT, (uint32_t*)&br, sizeof(br))
                  && (br.magic == RTC_BOOT_MAGIC);
  uint32_t lastUptime_s  = rtcValid ? br.uptime_s  : 0;
  uint32_t bootCount     = rtcValid ? br.boot_count + 1 : 1;

  // Update record immediately so loop() can increment uptime from zero
  br.magic      = RTC_BOOT_MAGIC;
  br.uptime_s   = 0;
  br.boot_count = bootCount;
  ESP.rtcUserMemoryWrite(RTC_BOOT_SLOT, (uint32_t*)&br, sizeof(br));

  // Format last uptime as h:mm:ss
  char uptimeBuf[24];
  if (rtcValid) {
    snprintf(uptimeBuf, sizeof(uptimeBuf), "%luh%02lum%02lus",
             lastUptime_s / 3600, (lastUptime_s % 3600) / 60, lastUptime_s % 60);
  } else {
    snprintf(uptimeBuf, sizeof(uptimeBuf), "unknown (power-on)");
  }

  // Build reset-reason string
  char reason[128];
  snprintf(reason, sizeof(reason), "reason=%d (%s)", ri->reason, ESP.getResetReason().c_str());
  // Crash reasons: 1=HW WDT, 3=exception, 4=soft WDT
  bool isCrash = (ri->reason == 1 || ri->reason == 3 || ri->reason == 4);
  if (isCrash) {
    char crash[128];
    snprintf(crash, sizeof(crash), " CRASH! exccause=%d epc1=0x%08X excvaddr=0x%08X",
             ri->exccause, ri->epc1, ri->excvaddr);
    cachedBootInfo = String(reason) + String(crash);
  } else {
    cachedBootInfo = String(reason);
  }

  Serial.printf("[BOOT] #%lu  last_uptime=%s  %s\n",
                bootCount, uptimeBuf, cachedBootInfo.c_str());
}

// ============================================================================
// LED Functions
// ============================================================================

void setupLEDs() {
  if (ledStrip) delete ledStrip;
  uint16_t ledType = ledRgbw ? (NEO_GRBW + NEO_KHZ800) : (NEO_GRB + NEO_KHZ800);
  ledStrip = new Adafruit_NeoPixel(NUM_LEDS, LED_PIN, ledType);
  ledStrip->begin();
  ledStrip->setBrightness(ledBrightness);
  ledStrip->clear();
  ledStrip->show();
  Serial.printf("[LED] 60-LED %s clock initialized\n", ledRgbw ? "RGBW" : "RGB");
}

void showLEDs() {
  if (!ledStrip) return;
  for (int i = 0; i < NUM_LEDS; i++) {
    int phys = ledReversed ? (NUM_LEDS - 1 - i) : i;
    if (ledRgbw)
      ledStrip->setPixelColor(phys, ledStrip->Color(leds[i].r, leds[i].g, leds[i].b, 0));
    else
      ledStrip->setPixelColor(phys, ledStrip->Color(leds[i].r, leds[i].g, leds[i].b));
  }
  ledStrip->show();
}

// ============================================================================
// Display Mode Functions
// ============================================================================

uint8_t addSat(uint8_t base, uint8_t add) {
  uint16_t v = (uint16_t)base + add;
  return (v > 255) ? 255 : (uint8_t)v;
}

void addPixelWrap(int index, uint8_t r, uint8_t g, uint8_t b) {
  int pos = index % NUM_LEDS;
  if (pos < 0) pos += NUM_LEDS;
  leds[pos].r = addSat(leds[pos].r, r);
  leds[pos].g = addSat(leds[pos].g, g);
  leds[pos].b = addSat(leds[pos].b, b);
}

void hsvToRgb(uint16_t hue, uint8_t sat, uint8_t val, uint8_t &r, uint8_t &g, uint8_t &b) {
  hue %= 360;
  uint8_t region = hue / 60;
  uint16_t rem = (hue % 60) * 255 / 60;
  uint8_t p = (uint16_t)val * (255 - sat) / 255;
  uint8_t q = (uint16_t)val * (255 - ((uint16_t)sat * rem / 255)) / 255;
  uint8_t t = (uint16_t)val * (255 - ((uint16_t)sat * (255 - rem) / 255)) / 255;
  switch (region) {
    case 0: r = val; g = t; b = p; break;
    case 1: r = q; g = val; b = p; break;
    case 2: r = p; g = val; b = t; break;
    case 3: r = p; g = q; b = val; break;
    case 4: r = t; g = p; b = val; break;
    default: r = val; g = p; b = q; break;
  }
}

void applyBrightnessAndShow() {
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].r = (uint16_t)leds[i].r * ledBrightness / 255;
    leds[i].g = (uint16_t)leds[i].g * ledBrightness / 255;
    leds[i].b = (uint16_t)leds[i].b * ledBrightness / 255;
  }
  showLEDs();
}

bool extractClock(int &hour12, int &hour24, int &minute, int &second, int &daySeconds) {
  time_t now = time(nullptr);
  if (now < 86400) {
    memset(leds, 0, sizeof(leds));
    leds[0] = {255, 0, 0};
    leds[NUM_LEDS - 1] = {255, 0, 0};
    showLEDs();
    return false;
  }
  struct tm* t = localtime(&now);
  hour24 = t->tm_hour;
  hour12 = t->tm_hour % 12;
  minute = t->tm_min;
  second = t->tm_sec;
  daySeconds = hour24 * 3600 + minute * 60 + second;
  return true;
}

CRGB blendSpectrumColor(const CRGB &base, uint8_t spectrum, uint8_t level, uint16_t phaseSeed) {
  if (spectrum == 0) return base;

  uint8_t rr = base.r;
  uint8_t gg = base.g;
  uint8_t bb = base.b;

  if (spectrum == 1) {
    uint8_t hueR, hueG, hueB;
    uint16_t hue = (uint16_t)((phaseSeed + millis() / 18) % 360);
    hsvToRgb(hue, 255, level, hueR, hueG, hueB);
    rr = addSat(base.r / 2, hueR / 2);
    gg = addSat(base.g / 2, hueG / 2);
    bb = addSat(base.b / 2, hueB / 2);
  } else if (spectrum == 2) {
    uint8_t tw = (uint8_t)((phaseSeed + (millis() / 24)) % 120);
    uint8_t swing = tw < 60 ? tw : (119 - tw);
    uint8_t boost = (uint8_t)(level / 4 + swing);
    rr = addSat(base.r, boost / 2);
    gg = addSat(base.g, boost / 3);
    bb = addSat(base.b, boost / 2);
  }

  return CRGB{rr, gg, bb};
}

ModeDisplayConfig defaultModeConfigFor(uint8_t mode) {
  ModeDisplayConfig cfg = {
    255, 0, 0,
    0, 255, 0,
    0, 0, 255,
    5,
    3,
    3,
    0
  };

  if (mode == DISPLAY_SIMPLE) {
    cfg.hourWidth = 3;
    cfg.minuteWidth = 3;
    cfg.secondWidth = 3;
  } else if (mode == DISPLAY_COMET) {
    cfg.hourWidth = 7;
    cfg.minuteWidth = 5;
    cfg.secondWidth = 10;
    cfg.spectrum = 1;
  } else if (mode == DISPLAY_PASTEL) {
    cfg = {
      190, 95, 150,
      110, 210, 170,
      110, 170, 220,
      3,
      3,
      3,
      0
    };
  } else if (mode == DISPLAY_NEON) {
    cfg = {
      255, 0, 220,
      0, 255, 220,
      255, 255, 0,
      3,
      3,
      3,
      2
    };
  }

