noless-zz/esp8266-led-strip-clock/src/main.cpp
  return cfg;
}

void setDefaultModeConfigs() {
  for (int m = 0; m < DISPLAY_MAX; m++) {
    modeConfigs[m] = defaultModeConfigFor((uint8_t)m);
  }
}

bool isModeConfigValid(const ModeDisplayConfig &cfg) {
  if (cfg.hourWidth < 1 || cfg.hourWidth > 21) return false;
  if (cfg.minuteWidth < 1 || cfg.minuteWidth > 21) return false;
  if (cfg.secondWidth < 1 || cfg.secondWidth > 30) return false;
  if (cfg.spectrum > 2) return false;
  return true;
}

void applyModeConfigDefaultsIfInvalid(uint8_t mode) {
  if (mode >= DISPLAY_MAX) return;
  if (!isModeConfigValid(modeConfigs[mode])) {
    setDefaultModeConfigs();
    return;
  }
}

void overlayTimeMarkers(int hour12, int minute, int second, const ModeDisplayConfig &cfg, int secTrailLen) {
  int hourPos = (hour12 * 5 + minute / 12) % NUM_LEDS;
  int minutePos = minute % NUM_LEDS;
  int secondPos = second % NUM_LEDS;

  int hCount = max(1, (int)cfg.hourWidth);
  int mCount = max(1, (int)cfg.minuteWidth);
  int sCount = max(1, (int)cfg.secondWidth);

  auto drawCenteredMarker = [&](int centerPos, int pixelCount, CRGB base, uint16_t seedBase) {
    int centerIdx = pixelCount / 2;
    int maxDist = max(centerIdx, pixelCount - 1 - centerIdx);
    for (int j = 0; j < pixelCount; j++) {
      int offset = j - centerIdx;
      int dist = abs(offset);
      uint8_t level = 255;
      if (maxDist > 0) {
        level = (uint8_t)(255 - (dist * 190 / maxDist));
      }
      CRGB col = blendSpectrumColor(base, cfg.spectrum, level, (uint16_t)(seedBase + j * 19));
      addPixelWrap(centerPos + offset, col.r, col.g, col.b);
    }
  };

  drawCenteredMarker(hourPos, hCount, CRGB{cfg.hourR, cfg.hourG, cfg.hourB}, 40);
  drawCenteredMarker(minutePos, mCount, CRGB{cfg.minuteR, cfg.minuteG, cfg.minuteB}, 120);
  drawCenteredMarker(secondPos, sCount, CRGB{cfg.secondR, cfg.secondG, cfg.secondB}, 220);

  int tail = max(0, secTrailLen);
  int tailStart = (sCount / 2) + 1;
  for (int i = 0; i < tail; i++) {
    int dist = tailStart + i;
    uint8_t level = (uint8_t)(220 - ((i + 1) * 200 / (tail + 1)));
    CRGB sc = blendSpectrumColor(CRGB{cfg.secondR, cfg.secondG, cfg.secondB}, cfg.spectrum, level, (uint16_t)(260 + (i + 1) * 17));
    addPixelWrap(secondPos - dist, sc.r, sc.g, sc.b);
  }
}

void displayMode_Simple() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_SIMPLE];

  memset(leds, 0, sizeof(leds));
  overlayTimeMarkers(hour12, minute, second, cfg, 0);
  applyBrightnessAndShow();
}

void displayMode_Pulse() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_PULSE];

  memset(leds, 0, sizeof(leds));
  uint32_t ms = millis();
  uint8_t beat = (uint8_t)((ms % 1000) < 500 ? ((ms % 500) * 80 / 500) : ((1000 - (ms % 1000)) * 80 / 500));

  // Very dim background pulse (reduced from previous)
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t base = 5 + beat / 8;
    leds[i] = {base / 4, base / 3, base / 2};
  }

  // Clear HMS markers with more contrast
  overlayTimeMarkers(hour12, minute, second, cfg, 7);
  applyBrightnessAndShow();
}

void displayMode_Pastel() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_PASTEL];

  memset(leds, 0, sizeof(leds));
  overlayTimeMarkers(hour12, minute, second, cfg, 2);
  applyBrightnessAndShow();
}

void displayMode_Binary() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_BINARY];

  memset(leds, 0, sizeof(leds));

  uint8_t bits[20];
  for (int i = 0; i < 20; i++) bits[i] = 0;

  for (int i = 0; i < 6; i++) bits[i] = (hour24 >> i) & 1;
  bits[6] = 2;
  for (int i = 0; i < 6; i++) bits[7 + i] = (minute >> i) & 1;
  bits[13] = 2;
  for (int i = 0; i < 6; i++) bits[14 + i] = (second >> i) & 1;

  for (int slot = 0; slot < 20; slot++) {
    for (int j = 0; j < 3; j++) {
      int idx = slot * 3 + j;
      if (bits[slot] == 2) {
        leds[idx] = {15, 15, 15};
      } else if (slot < 7) {
        leds[idx] = bits[slot] ? CRGB{220, 60, 60} : CRGB{20, 6, 6};
      } else if (slot < 14) {
        leds[idx] = bits[slot] ? CRGB{60, 220, 60} : CRGB{6, 20, 6};
      } else {
        leds[idx] = bits[slot] ? CRGB{60, 120, 255} : CRGB{6, 10, 20};
      }
    }
  }

  overlayTimeMarkers(hour12, minute, second, cfg, 1);
  applyBrightnessAndShow();
}

void displayMode_HourMarker() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_HOUR_MARKER];

  memset(leds, 0, sizeof(leds));

  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t base = (i <= minute) ? 40 : 12;
    leds[i] = {base / 4, base, base / 2};
  }

  overlayTimeMarkers(hour12, minute, second, cfg, 9);
  applyBrightnessAndShow();
}

void displayMode_Neon() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_NEON];

  memset(leds, 0, sizeof(leds));
  overlayTimeMarkers(hour12, minute, second, cfg, 2);
  applyBrightnessAndShow();
}

void displayMode_Comet() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_COMET];

  memset(leds, 0, sizeof(leds));
  int cometTail = 4 + (int)cfg.secondWidth * 2;
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t dim = (uint8_t)(2 + (i % 7));
    leds[i] = {dim, dim, dim};
  }
  overlayTimeMarkers(hour12, minute, second, cfg, cometTail);
  applyBrightnessAndShow();
}

void displayMode_Flame() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_FLAME];

  // Optimize: update flame only every 50ms (20 times/sec instead of 60)
  static uint32_t lastUpdate = 0;
  uint32_t now = millis();
  
  if (now - lastUpdate > 50) {  // Update max 20 times/sec instead of 60
    lastUpdate = now;
    uint32_t phase = now / 40;  // Slower phase calculation
    
    for (int i = 0; i < NUM_LEDS; i++) {
      // Simplified pseudo-random without heavy multiplication
      uint32_t x = (uint32_t)(i * 41 + phase * 7);
      uint8_t flicker = (uint8_t)((x ^ (x >> 4)) & 0x3F);  // Reduced bit ops
      uint8_t r = 80 + flicker;
      uint8_t g = 15 + flicker / 3;
      uint8_t b = 2;
      leds[i] = {r, g, b};
    }
  }

  overlayTimeMarkers(hour12, minute, second, cfg, 9);
  applyBrightnessAndShow();
}

// Boot progress stages --" advances externally as system state changes
enum BootStage {
  BOOT_STAGE_INIT     = 0,  // just started          --" red,    LEDs 0-14
  BOOT_STAGE_AP_UP    = 1,  // AP is up              --" orange, LEDs 0-29
  BOOT_STAGE_SCANNING = 2,  // scanning networks     --" yellow, LEDs 0-44
  BOOT_STAGE_STA_CONN = 3,  // STA connecting        --" blue,   LEDs 0-59
  BOOT_STAGE_WIFI_OK  = 4,  // WiFi connected        --" green,  fill 60
  BOOT_STAGE_NTP_WAIT = 5,  // waiting for NTP       --" cyan,   full bounce
};
BootStage bootStage = BOOT_STAGE_INIT;

void displayBootAnimation() {
  if (!ledStrip) return;

