noless-zz/esp8266-led-strip-clock/src/main.cpp
  // Each stage: {r, g, b, lastLED (inclusive), stepMs}
  struct StageStyle { uint8_t r, g, b; uint8_t lastLed; uint8_t stepMs; };
  static const StageStyle styles[] = {
    {80,  0,  0, 14, 60},   // INIT     --" red,    slow
    {80, 40,  0, 29, 50},   // AP_UP    --" orange
    {70, 70,  0, 44, 40},   // SCANNING --" yellow
    { 0, 30, 90, 59, 30},   // STA_CONN --" blue,   fast
    { 0, 80,  0, 59, 20},   // WIFI_OK  --" green,  fast fill
    { 0, 70, 70, 59, 25},   // NTP_WAIT --" cyan
  };

  const StageStyle& s = styles[(int)bootStage];

  static int  pos       = 0;
  static int  dir       = 1;
  static int  fillCount = 0;
  static BootStage lastStage = BOOT_STAGE_INIT;
  static unsigned long lastStep = 0;

  // Reset bounce position when stage changes
  if (bootStage != lastStage) {
    pos = 0; dir = 1; fillCount = 0;
    lastStage = bootStage;
  }

  if (millis() - lastStep < s.stepMs) return;
  lastStep = millis();

  ledStrip->setBrightness(28);
  ledStrip->clear();

  const uint8_t TAIL = 7;

  if (bootStage == BOOT_STAGE_WIFI_OK) {
    // Green creeping fill --" LED 0..fillCount lit, then a bright head
    if (fillCount < NUM_LEDS) fillCount++;
    for (int i = 0; i < fillCount; i++)
      ledStrip->setPixelColor(i, ledStrip->Color(0, 25, 0));
    if (fillCount < NUM_LEDS)
      ledStrip->setPixelColor(fillCount, ledStrip->Color(0, 80, 0));
  } else {
    // Bouncing comet within 0..lastLed
    int span = s.lastLed + 1;

    // Draw tail
    for (int t = 1; t <= TAIL; t++) {
      int idx = pos - dir * t;
      if (idx >= 0 && idx < span) {
        uint8_t fade = (TAIL - t + 1) * 255 / ((TAIL + 1) * 8);
        ledStrip->setPixelColor(idx, ledStrip->Color(
          s.r * fade / 32, s.g * fade / 32, s.b * fade / 32));
      }
    }
    // Draw head
    ledStrip->setPixelColor(pos, ledStrip->Color(s.r, s.g, s.b));

    // Bounce
    pos += dir;
    if (pos >= span) { pos = span - 2; dir = -1; }
    if (pos < 0)     { pos = 1;        dir =  1; }
  }

  ledStrip->show();
}

void displayClock() {
  time_t now = time(nullptr);
  bool ntpSynced = (now >= 86400);

  // forceStatusDisplay beats everything --" always show animation
  // otherwise: show animation until NTP synced, unless forceClockDisplay
  if (forceStatusDisplay || (!ntpSynced && !forceClockDisplay)) {
    displayBootAnimation();
    return;
  }

  // Restore user brightness when transitioning to clock for the first time
  static bool brightnessRestored = false;
  if (!brightnessRestored) {
    if (ledStrip) ledStrip->setBrightness(ledBrightness);
    brightnessRestored = true;
  }

  // Dispatcher: choose display mode
  switch (displayMode) {
    case DISPLAY_SIMPLE:
      displayMode_Simple();
      break;
    case DISPLAY_PULSE:
      displayMode_Pulse();
      break;
    case DISPLAY_BINARY:
      displayMode_Binary();
      break;
    case DISPLAY_HOUR_MARKER:
      displayMode_HourMarker();
      break;
    case DISPLAY_FLAME:
      displayMode_Flame();
      break;
    case DISPLAY_PASTEL:
      displayMode_Pastel();
      break;
    case DISPLAY_NEON:
      displayMode_Neon();
      break;
    case DISPLAY_COMET:
      displayMode_Comet();
      break;
    case DISPLAY_SOLID:
    default:
      displayClock_Solid();
      break;
  }
}

void displayClock_Solid() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_SOLID];

  memset(leds, 0, sizeof(leds));
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t r, g, b;
    hsvToRgb((i * 6 + second * 6) % 360, 180, 30, r, g, b);
    leds[i] = {r, g, b};
  }

  overlayTimeMarkers(hour12, minute, second, cfg, 9);
  applyBrightnessAndShow();
}

// ============================================================================
// EEPROM Functions
// ============================================================================

void saveDisplayModeToEEPROM() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.write(EEPROM_DISPLAY_MODE_ADDR, (uint8_t)displayMode);
  EEPROM.commit();
}

void saveModeConfigToEEPROM(uint8_t mode) {
  if (mode >= DISPLAY_MAX) return;
  int addr = EEPROM_MODE_CFG_BASE_ADDR + (int)mode * (int)sizeof(ModeDisplayConfig);
  EEPROM.begin(EEPROM_SIZE);
  const uint8_t *raw = reinterpret_cast<const uint8_t*>(&modeConfigs[mode]);
  for (unsigned int i = 0; i < sizeof(ModeDisplayConfig); i++) {
    EEPROM.write(addr + (int)i, raw[i]);
  }
  EEPROM.write(EEPROM_MODE_CFG_MAGIC_ADDR, EEPROM_MODE_CFG_MAGIC);
  EEPROM.commit();
}

void loadModeConfigsFromEEPROM() {
  setDefaultModeConfigs();
  EEPROM.begin(EEPROM_SIZE);

  if (EEPROM.read(EEPROM_MODE_CFG_MAGIC_ADDR) != EEPROM_MODE_CFG_MAGIC) {
    for (uint8_t m = 0; m < DISPLAY_MAX; m++) {
      saveModeConfigToEEPROM(m);
    }
    return;
  }

  for (uint8_t m = 0; m < DISPLAY_MAX; m++) {
    int addr = EEPROM_MODE_CFG_BASE_ADDR + (int)m * (int)sizeof(ModeDisplayConfig);
    ModeDisplayConfig loaded;
    uint8_t *raw = reinterpret_cast<uint8_t*>(&loaded);
    for (unsigned int i = 0; i < sizeof(ModeDisplayConfig); i++) {
      raw[i] = EEPROM.read(addr + (int)i);
    }
    if (isModeConfigValid(loaded)) {
      modeConfigs[m] = loaded;
    }
  }
}

void loadEEPROMSettings() {
  EEPROM.begin(EEPROM_SIZE);
  uint8_t magic = EEPROM.read(EEPROM_MAGIC_ADDR);
  if (magic != EEPROM_MAGIC) {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.write(EEPROM_DISPLAY_MODE_ADDR, (uint8_t)displayMode);
    EEPROM.commit();
    loadModeConfigsFromEEPROM();
    Serial.println("[EEPROM] Initialized new settings");
    return;
  }
  
  // Load WiFi SSID --" reject if any byte is non-printable (garbage/uninitialized EEPROM)
  String ssid = "";
  bool ssidValid = true;
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    char c = EEPROM.read(EEPROM_SSID_ADDR + i);
    if (c == 0) break;
    if (c < 0x20 || c > 0x7E) { ssidValid = false; break; }
    ssid += c;
  }
  if (!ssidValid || ssid.length() == 0) {
    Serial.println("[EEPROM] No valid WiFi credentials stored");
  } else {
    String pass = "";
    for (int i = 0; i < MAX_PASS_LEN; i++) {
      char c = EEPROM.read(EEPROM_PASS_ADDR + i);
      if (c == 0) break;
      pass += c;
    }
    Serial.println("[EEPROM] Loaded WiFi: " + ssid);
    // DEBUG: dump password bytes to verify EEPROM integrity
    Serial.printf("[EEPROM] Pass len=%d chars: [", pass.length());
    for (unsigned int i = 0; i < pass.length(); i++) {
      Serial.printf("%c(0x%02X)", pass[i], (uint8_t)pass[i]);
      if (i < pass.length() - 1) Serial.print(' ');
    }
    Serial.println("]");
    savedSsid = ssid;
    savedPass = pass;  // will be used in setupWiFi() after AP is up
  }
  
  // Load brightness
  uint8_t br = EEPROM.read(EEPROM_BRIGHTNESS_ADDR);
  if (br > 0 && br <= 255) ledBrightness = br;

  // Load LED type
  uint8_t rgbwFlag = EEPROM.read(EEPROM_RGBW_ADDR);
  if (rgbwFlag == 0x01 || rgbwFlag == 0x00) ledRgbw = (rgbwFlag == 0x01);

