noless-zz/esp8266-led-strip-clock/src/main.cpp
  // Load LED direction
  uint8_t revFlag = EEPROM.read(EEPROM_REVERSED_ADDR);
  if (revFlag == 0x01 || revFlag == 0x00) ledReversed = (revFlag == 0x01);
  
  // Load timezone offset
  int32_t tzOff = (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 0) << 24) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 1) << 16) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 2) << 8) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 3));
  if (tzOff != 0 && tzOff >= -43200 && tzOff <= 43200) tz.utcOffset = tzOff;
  
  // Load display mode
  uint8_t mode = EEPROM.read(EEPROM_DISPLAY_MODE_ADDR);
  if (mode < DISPLAY_MAX) displayMode = (DisplayMode)mode;

  loadModeConfigsFromEEPROM();

  // Load debug remote logging settings
  if (EEPROM.read(EEPROM_DBG_MAGIC_ADDR) == EEPROM_DBG_MAGIC) {
    debugRemoteEnabled = (EEPROM.read(EEPROM_DBG_ENABLED_ADDR) == 0x01);
    char ipBuf[17] = {};
    for (int i = 0; i < 16; i++) ipBuf[i] = (char)EEPROM.read(EEPROM_DBG_IP_ADDR + i);
    ipBuf[16] = 0;
    debugServerIp = String(ipBuf);
    uint16_t pHi = EEPROM.read(EEPROM_DBG_PORT_ADDR);
    uint16_t pLo = EEPROM.read(EEPROM_DBG_PORT_ADDR + 1);
    uint16_t p = (pHi << 8) | pLo;
    if (p > 0 && p < 65535) debugServerPort = p;
  }
}

void saveDebugConfig() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.write(EEPROM_DBG_MAGIC_ADDR, EEPROM_DBG_MAGIC);
  EEPROM.write(EEPROM_DBG_ENABLED_ADDR, debugRemoteEnabled ? 0x01 : 0x00);
  for (int i = 0; i < 16; i++) {
    EEPROM.write(EEPROM_DBG_IP_ADDR + i, (uint8_t)(i < (int)debugServerIp.length() ? debugServerIp[i] : 0));
  }
  EEPROM.write(EEPROM_DBG_PORT_ADDR,     (debugServerPort >> 8) & 0xFF);
  EEPROM.write(EEPROM_DBG_PORT_ADDR + 1, debugServerPort & 0xFF);
  EEPROM.commit();
}

void saveEEPROMSettings(const String& ssid, const String& pass) {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
  
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    EEPROM.write(EEPROM_SSID_ADDR + i, i < ssid.length() ? ssid[i] : 0);
  }
  
  for (int i = 0; i < MAX_PASS_LEN; i++) {
    EEPROM.write(EEPROM_PASS_ADDR + i, i < pass.length() ? pass[i] : 0);
  }
  
  EEPROM.write(EEPROM_BRIGHTNESS_ADDR, ledBrightness);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 0, (tz.utcOffset >> 24) & 0xFF);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 1, (tz.utcOffset >> 16) & 0xFF);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 2, (tz.utcOffset >> 8) & 0xFF);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 3, tz.utcOffset & 0xFF);
  EEPROM.write(EEPROM_DISPLAY_MODE_ADDR, (uint8_t)displayMode);
  
  EEPROM.commit();
  Serial.println("[EEPROM] Saved settings for " + ssid);
  DLOGI("EEPROM", "Settings saved  ssid=%s  heap=%u", ssid.c_str(), ESP.getFreeHeap());
}

// ============================================================================
// Time & Timezone Functions
// ============================================================================

void syncTimeNTP() {
  if (!wifiConnected) return;
  bootStage = BOOT_STAGE_NTP_WAIT;
  Serial.println("[NTP] Syncing with " + String(NTP_SERVER));
  configTime(tz.utcOffset, 0, NTP_SERVER);
  time_t now = time(nullptr);
  int attempts = 50;
  while (now < 86400 && attempts-- > 0) { delay(100); now = time(nullptr); }
  if (now > 86400) {
    Serial.println("[NTP] Time synced");
    DLOGI("NTP", "Synced  epoch=%lu  tz=%s  heap=%u", (unsigned long)now, tz.name.c_str(), ESP.getFreeHeap());
  } else {
    DLOGW("NTP", "Sync failed after %d attempts  heap=%u", 50, ESP.getFreeHeap());
  }
  lastNtpSync = millis();
}

void detectTimezone() {
  tzDiag.source = "ip-api.com";
  tzDiag.lastAttemptMs = millis();
  tzDiag.status = "running";
  tzDiag.message = "starting detection";
  tzDiag.httpCode = 0;
  tzDiag.responseSample = "";

  if (!wifiConnected) {
    tzDiag.status = "error";
    tzDiag.message = "wifi not connected";
    Serial.println("[GEO] Not connected to WiFi, skipping timezone detection");
    return;
  }
  DLOGI("TZ", "Auto-detect start  heap=%u", ESP.getFreeHeap());

  struct TzProvider { const char* host; const char* path; const char* label; };
  TzProvider providers[] = {
    {"ip-api.com", "/json/?fields=status,message,timezone,offset,country,city", "ip-api"},
    {"ipwho.is", "/", "ipwho.is"}
  };

  bool detected = false;
  for (size_t p = 0; p < (sizeof(providers) / sizeof(providers[0])); p++) {
    WiFiClient client;
    tzDiag.source = providers[p].label;

    DLOGI("TZ", "Trying %s (heap=%u)", providers[p].label, ESP.getFreeHeap());
    if (!client.connect(providers[p].host, 80)) {
      tzDiag.status = "error";
      tzDiag.message = String("connect failed to ") + providers[p].host;
      DLOGW("TZ", "%s connect failed", providers[p].label);
      continue;
    }
    DLOGI("TZ", "%s connected", providers[p].label);

    client.print("GET ");
    client.print(providers[p].path);
    client.print(" HTTP/1.0\r\nHost: ");
    client.print(providers[p].host);
    client.print("\r\nUser-Agent: LED-Clock/2.0\r\nConnection: close\r\n\r\n");

    String line;
    while (client.connected()) {
      line = client.readStringUntil('\n');
      if (line.startsWith("HTTP/")) {
        int sp = line.indexOf(' ');
        if (sp > 0 && sp + 4 <= line.length()) {
          tzDiag.httpCode = line.substring(sp + 1, sp + 4).toInt();
        }
      }
      if (line == "\r") break;
    }

    String body;
    unsigned long readStart = millis();
    while (millis() - readStart < 5000) {
      while (client.available()) {
        body += (char)client.read();
        readStart = millis();
      }
      if (!client.connected() && !client.available()) break;
      delay(5);
    }
    client.stop();
    body.trim();

    if (body.length() == 0) {
      tzDiag.status = "error";
      tzDiag.message = "empty response body";
      tzDiag.responseSample = "<empty>";
      continue;
    }

    int startObj = body.indexOf('{');
    int endObj = body.lastIndexOf('}');
    if (startObj >= 0 && endObj > startObj) {
      body = body.substring(startObj, endObj + 1);
    }

    tzDiag.responseSample = body.substring(0, 160);

    DynamicJsonDocument doc(1024);
    DeserializationError error = deserializeJson(doc, body);
    if (error) {
      tzDiag.status = "error";
      tzDiag.message = (body[0] != '{' && body[0] != '[')
        ? ("non-json response (http " + String(tzDiag.httpCode) + ")")
        : ("json parse failed: " + String(error.c_str()));
      continue;
    }

