noless-zz/esp8266-led-strip-clock/src/main.cpp
  return true;
}

void updateWiFiConnect() {
  if (!wifiConnect.active) return;

  wl_status_t status = WiFi.status();

  // Log every status change during connection attempt
  if (status != wifiConnect.lastStatus) {
    unsigned long elapsed = millis() - wifiConnect.startedAt;
    Serial.printf("[WiFi] Status changed: %s -> %s  (+%lums)\n",
                  wlStatusName(wifiConnect.lastStatus), wlStatusName(status), elapsed);
    wifiConnect.lastStatus = status;
  }

  if (status == WL_CONNECTED) {
    wifiConnect.active = false;
    wifiConnect.connecting = false;
    wifiConnect.success = true;
    wifiConnected = true;
    bootStage = BOOT_STAGE_WIFI_OK;
    Serial.print("[WiFi] Connected! IP: ");
    Serial.println(WiFi.localIP());
    DLOGI("WiFi", "Connected  ssid=%s  ip=%s  rssi=%d  ch=%d  heap=%u",
          WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(),
          WiFi.RSSI(), (int)WiFi.channel(), ESP.getFreeHeap());
    if (!bootInfoSent) {
      bootInfoSent = true;
      DLOGI("BOOT", "fw=%s  %s", FW_VERSION_BASE, cachedBootInfo.c_str());
    }
    detectTimezone();
  } else if (status == WL_CONNECT_FAILED || status == WL_NO_SSID_AVAIL) {
    wifiConnect.active = false;
    wifiConnect.connecting = false;
    wifiConnect.success = false;
    wifiConnect.error = "Connection failed";
    Serial.printf("[WiFi] Failed with status %d (%s) after %lums\n",
                  (int)status, wlStatusName(status), millis() - wifiConnect.startedAt);
    DLOGE("WiFi", "FAILED  status=%s  ssid=%s  after=%lums  heap=%u",
          wlStatusName(status), wifiConnect.attemptedSsid.c_str(),
          millis() - wifiConnect.startedAt, ESP.getFreeHeap());
  } else if (millis() - wifiConnect.startedAt > 20000) {
    // Timeout -- clear state, trigger a fresh scan, retry after scan completes
    wifiConnect.active = false;
    wifiConnect.connecting = false;
    wifiConnect.success = false;
    wifiConnect.error = "Connection timeout";
    Serial.printf("[WiFi] Timeout! Last status: %d (%s) -- rescanning and will retry\n",
                  (int)status, wlStatusName(status));
    DLOGW("WiFi", "TIMEOUT  status=%s  ssid=%s  heap=%u",
          wlStatusName(status), wifiConnect.attemptedSsid.c_str(), ESP.getFreeHeap());
    WiFi.disconnect(false);
    WiFi.scanNetworks(true, true);  // async rescan; boot auto-connect logic will retry
  } else {
    // Heartbeat every 5s so we can see it's still trying
    static unsigned long lastHeartbeat = 0;
    if (millis() - lastHeartbeat > 5000) {
      lastHeartbeat = millis();
      Serial.printf("[WiFi] Still connecting... status=%s  elapsed=%lus\n",
                    wlStatusName(status), (millis() - wifiConnect.startedAt) / 1000);
    }
  }
}

// ============================================================================
// OTA & Firmware Update
// ============================================================================

uint32_t getMaxUpdateSize() {
  return (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
}

const char* updateErrorToString(uint8_t error) {
  switch (error) {
    case UPDATE_ERROR_OK: return "OK";
    case UPDATE_ERROR_WRITE: return "Flash write failed";
    case UPDATE_ERROR_ERASE: return "Flash erase failed";
    case UPDATE_ERROR_READ: return "Flash read failed";
    case UPDATE_ERROR_SPACE: return "Not enough flash space";
    case UPDATE_ERROR_SIZE: return "Binary size mismatch";
    case UPDATE_ERROR_STREAM: return "Upload stream timeout/error";
    case UPDATE_ERROR_MD5: return "MD5 validation failed";
    case UPDATE_ERROR_MAGIC_BYTE: return "Invalid firmware magic byte";
    case UPDATE_ERROR_FLASH_CONFIG: return "Flash config mismatch";
    case UPDATE_ERROR_NEW_FLASH_CONFIG: return "New flash config invalid";
    case UPDATE_ERROR_BOOTSTRAP: return "Bootstrap validation failed";
    case UPDATE_ERROR_OOM: return "Out of memory during update";
    case UPDATE_ERROR_NO_DATA: return "No OTA data received";
    default: return "Unknown OTA error";
  }
}

// ============================================================================
// Web Pages (HTML)
// ============================================================================

const char INDEX_HTML[] PROGMEM = R"html(
<!DOCTYPE html><html><head><meta charset='utf-8'/><meta name='viewport' content='width=device-width, initial-scale=1'/>
<title>LED Clock</title><style>
*{margin:0;padding:0;box-sizing:border-box}body{font-family:system-ui;background:linear-gradient(135deg,#667eea,#764ba2);min-height:100vh;padding:20px;color:#333}
.container{max-width:600px;margin:0 auto}.clock-card{background:#fff;border-radius:20px;padding:40px 20px;margin-bottom:20px;box-shadow:0 10px 40px rgba(0,0,0,0.3);text-align:center}
.clock-time{font-size:72px;font-weight:300;letter-spacing:4px;color:#667eea;margin-bottom:10px;font-variant-numeric:tabular-nums}
.card{background:#fff;border-radius:16px;padding:20px;margin-bottom:15px;box-shadow:0 5px 20px rgba(0,0,0,0.2)}
h3{font-size:14px;letter-spacing:2px;text-transform:uppercase;color:#999;margin-bottom:15px}
.grid{display:grid;grid-template-columns:1fr 1fr;gap:15px}.item{padding:12px;background:#f5f5f5;border-radius:8px;text-align:center}
.label{font-size:11px;color:#999;text-transform:uppercase}.value{font-size:16px;font-weight:600;color:#333;margin-top:5px}
.btn{width:100%;padding:12px;border:none;border-radius:6px;font-weight:bold;cursor:pointer;text-transform:uppercase;letter-spacing:1px;background:linear-gradient(135deg,#667eea,#764ba2);color:#fff;margin-bottom:10px}
.btn:active{opacity:.9}.btn-sm{padding:8px 16px;border:none;border-radius:6px;font-weight:bold;cursor:pointer;font-size:12px;letter-spacing:1px}
.btn-clock{background:#667eea;color:#fff}.btn-status{background:#eee;color:#555}
.stage-bar{display:flex;gap:4px;margin:12px 0}.stage-pip{flex:1;height:8px;border-radius:4px;background:#eee;transition:.4s}
.stage-pip.done{background:#4CAF50}.stage-pip.active{background:#667eea}.ring-badge{display:inline-block;padding:4px 12px;border-radius:20px;font-size:12px;font-weight:bold;letter-spacing:1px}
.badge-clock{background:#e8f5e9;color:#2e7d32}.badge-status{background:#e3f2fd;color:#1565c0}
</style></head><body><div class='container'>
<div class='clock-card'><div class='clock-time' id='time'>--:--:--</div><div style='font-size:16px;color:#999;margin-top:10px' id='date'>Loading</div></div>

<div class='card'><h3>Ring Display</h3>
<div style='display:flex;align-items:center;justify-content:space-between;margin-bottom:10px'>
<div><div class='label'>Showing</div><span class='ring-badge' id='ringBadge'>--</span></div>
<div><div class='label'>Boot Stage</div><div class='value' id='stageName'>--</div></div>
</div>
<div class='stage-bar'>
<div class='stage-pip' id='pip0' title='Booting'></div>
<div class='stage-pip' id='pip1' title='AP Ready'></div>
<div class='stage-pip' id='pip2' title='Scanning'></div>
<div class='stage-pip' id='pip3' title='Connecting'></div>
<div class='stage-pip' id='pip4' title='WiFi OK'></div>
<div class='stage-pip' id='pip5' title='NTP'></div>
</div>
<div style='display:flex;gap:8px;margin-top:12px'>
<button class='btn-sm btn-clock' style='flex:1' onclick='setRingMode(1)'>Show Clock</button>
<button class='btn-sm btn-status' style='flex:1' onclick='setRingMode(0)'>Show Status</button>
</div></div>

