noless-zz/esp8266-led-strip-clock/src/main.cpp
void setupWiFi() {
  Serial.println("[WiFi] Starting AP+STA mode...");
  WiFi.mode(WIFI_AP_STA);

  // Log when a device connects/disconnects from our AP
  WiFi.onSoftAPModeStationConnected([](const WiFiEventSoftAPModeStationConnected& e) {
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
             e.mac[0], e.mac[1], e.mac[2], e.mac[3], e.mac[4], e.mac[5]);
    Serial.printf("[AP] Client connected:    MAC=%s  aid=%d  clients=%d\n",
                  mac, e.aid, WiFi.softAPgetStationNum());
  });
  WiFi.onSoftAPModeStationDisconnected([](const WiFiEventSoftAPModeStationDisconnected& e) {
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
             e.mac[0], e.mac[1], e.mac[2], e.mac[3], e.mac[4], e.mac[5]);
    Serial.printf("[AP] Client disconnected: MAC=%s  aid=%d  clients=%d\n",
                  mac, e.aid, WiFi.softAPgetStationNum());
  });

  WiFi.softAP(AP_SSID, AP_PASS);
  bootStage = BOOT_STAGE_AP_UP;
  Serial.println("[WiFi] AP: " + String(AP_SSID));
  Serial.println("[WiFi] AP IP: " + WiFi.softAPIP().toString());

}

void setupDNS() {
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  Serial.println("[DNS] Captive portal ready");
}

void setupOTA() {
  ArduinoOTA.setPassword(OTA_PASS);
  ArduinoOTA.onStart([]() {
    DLOGI("OTA", "ArduinoOTA start  heap=%u", ESP.getFreeHeap());
  });
  ArduinoOTA.onEnd([]() {
    DLOGI("OTA", "ArduinoOTA end -- rebooting");
  });
  ArduinoOTA.onError([](ota_error_t err) {
    DLOGE("OTA", "ArduinoOTA error %u", (unsigned)err);
  });
  ArduinoOTA.begin();
  Serial.println("[OTA] Ready");
}

// ============================================================================
// Main Setup & Loop
// ============================================================================

void setup() {
  Serial.begin(115200);
  delay(100);

  // Build unique AP SSID from last 3 MAC bytes, e.g. "LED-Clock-A1B2C3"
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char macSuffix[7];
  snprintf(macSuffix, sizeof(macSuffix), "%02X%02X%02X", mac[3], mac[4], mac[5]);
  AP_SSID_STR = String("LED-Clock-") + macSuffix;
  AP_SSID = AP_SSID_STR.c_str();

  Serial.println("\n\n");
  Serial.println("  ESP8266 LED Strip Clock v" + String(FW_VERSION_BASE) + " (" + FW_BUILD_TIME + ")");
  Serial.println("  60-LED NeoPixel Clock with NTP Sync");
  Serial.println("\n");
  
  captureBootInfo();
  setupLEDs();
  loadEEPROMSettings();
  setupWiFi();
  setupDNS();
  setupOTA();
  setupWebServer();
  
  WiFi.scanNetworks(true, true);  // Start first scan
  
  Serial.println("[READY] Access point: " + String(AP_SSID));
  Serial.println("[READY] Open browser: http://192.168.4.1\n");
}

void loop() {
  // Auto-connect: wait for a scan to finish so we have a channel hint, then connect.
  // Also handles retries after timeout (updateWiFiConnect triggers a rescan on timeout).
  if (!wifiConnected && !wifiConnect.active && savedSsid.length() > 0) {
    int scanState = WiFi.scanComplete();
    if (scanState == WIFI_SCAN_RUNNING) {
      if (bootStage < BOOT_STAGE_SCANNING) bootStage = BOOT_STAGE_SCANNING;
    } else if (scanState >= 0) {
      Serial.printf("[WiFi] Scan done (%d networks). Connecting to: %s\n",
                    scanState, savedSsid.c_str());
      getWifiScanJson();  // populate scan cache

      bootStage = BOOT_STAGE_STA_CONN;
      startWiFiConnect(savedSsid, savedPass);  // AP channel switch now done inside startWiFiConnect
    } else if (scanState == WIFI_SCAN_FAILED) {
      Serial.println("[WiFi] Scan failed, connecting without channel hint");
      bootStage = BOOT_STAGE_STA_CONN;
      startWiFiConnect(savedSsid, savedPass);
    }
    // WIFI_SCAN_RUNNING: keep waiting
  }

  dnsServer.processNextRequest();
  if (mdnsStarted) {
    MDNS.update();
  } else if (WiFi.status() == WL_CONNECTED && !mdnsStarted) {
    MDNS.begin("ledclock");
    mdnsStarted = true;
    Serial.println("[mDNS] Available at http://ledclock.local");
  }
  
  // Serial command interface
  // Commands:  wifi <SSID> [password]   --" connect (omit password for open networks)
  //            scan                     --" trigger scan and print results
  //            status                   --" print current WiFi/time status
  //            disconnect               --" disconnect STA
  if (Serial.available()) {
    String line = Serial.readStringUntil('\n');
    line.trim();
    if (line.length() > 0) {
      Serial.println("[CMD] > " + line);
      if (line.equalsIgnoreCase("status")) {
        Serial.printf("[CMD] WiFi: %s  SSID: %s  IP: %s\n",
          wifiConnected ? "connected" : "disconnected",
          WiFi.SSID().c_str(),
          WiFi.localIP().toString().c_str());
        Serial.printf("[CMD] AP: %s  ch=%d\n", AP_SSID, WiFi.channel());
        time_t now = time(nullptr);
        Serial.printf("[CMD] Time: %s  NTP: %s\n",
          ctime(&now), now > 86400 ? "synced" : "waiting");
        const char* modeNames[] = {"SOLID","SIMPLE","PULSE","BINARY","HOUR_MARKER","FLAME","PASTEL","NEON","COMET"};
        Serial.printf("[CMD] Display mode: %d (%s)  bootStage: %d  brightness: %d\n",
          (int)displayMode, displayMode < DISPLAY_MAX ? modeNames[displayMode] : "?",
          (int)bootStage, ledBrightness);
      } else if (line.equalsIgnoreCase("scan")) {
        Serial.println("[CMD] Starting scan...");
        WiFi.scanNetworks(true, true);
      } else if (line.equalsIgnoreCase("disconnect")) {
        WiFi.disconnect(false);
        wifiConnected = false;
        wifiConnect.active = false;
        savedSsid = "";
        savedPass = "";
        Serial.println("[CMD] Disconnected and cleared saved credentials");
      } else if (line.startsWith("wifi ") || line.startsWith("wifi\t")) {
        String args = line.substring(5);
        args.trim();
        int space = args.indexOf(' ');
        String ssid, pass;
        if (space < 0) {
          ssid = args;
          pass = "";
        } else {
          ssid = args.substring(0, space);
          pass = args.substring(space + 1);
          pass.trim();
        }
        if (ssid.length() == 0) {
          Serial.println("[CMD] Usage: wifi <SSID> [password]");
        } else {
          savedSsid = ssid;
          savedPass = pass;
          Serial.printf("[CMD] Connecting to \"%s\" %s\n",
            ssid.c_str(), pass.length() ? "with password" : "(open network)");
          wifiConnect.active = false;  // reset so startWiFiConnect accepts it
          startWiFiConnect(ssid, pass, true);
        }
      } else if (line.startsWith("mode ")) {
        int m = line.substring(5).toInt();
        if (m >= 0 && m < DISPLAY_MAX) {
          displayMode = (DisplayMode)m;
          saveDisplayModeToEEPROM();
          const char* modeNames[] = {"SOLID","SIMPLE","PULSE","BINARY","HOUR_MARKER","FLAME","PASTEL","NEON","COMET"};
          Serial.printf("[CMD] Display mode set to %d (%s)\n", m, modeNames[m]);
        } else {
          Serial.printf("[CMD] Mode must be 0-%d  (0=SOLID 1=SIMPLE 2=PULSE 3=BINARY 4=HOUR_MARKER 5=FLAME 6=PASTEL 7=NEON 8=COMET)\n", DISPLAY_MAX-1);
        }
      } else {
        Serial.println("[CMD] Commands: wifi <SSID> [pass]  |  scan  |  status  |  disconnect  |  mode <0-8>");
      }
    }
  }

  checkWiFi();
  updateWiFiConnect();
  ArduinoOTA.handle();
  
  // Trigger NTP sync after WiFi connects
  // Retry NTP every 20s until synced, then every hour
  bool ntpSynced = (time(nullptr) > 86400);
  unsigned long ntpInterval = ntpSynced ? 3600000UL : 20000UL;
  if (wifiConnected && millis() - lastNtpSync > ntpInterval) {
    syncTimeNTP();
  }
  
  // Refresh timezone daily if auto-detected
  if (wifiConnected && tz.autoDetected && millis() - lastTzCheck > 86400000) {
    detectTimezone();
  }
  
  // Periodic RTC uptime save + debug heartbeat (every 30s)
  {
    static unsigned long lastHb = 0;
    if (millis() - lastHb > 30000) {
      lastHb = millis();
      // Save current uptime to RTC so next boot can report it
      BootRecord br = {};
      ESP.rtcUserMemoryRead(RTC_BOOT_SLOT, (uint32_t*)&br, sizeof(br));
      br.magic    = RTC_BOOT_MAGIC;
      br.uptime_s = millis() / 1000;
      ESP.rtcUserMemoryWrite(RTC_BOOT_SLOT, (uint32_t*)&br, sizeof(br));
      // UDP heartbeat only when debug is connected
      if (wifiConnected && debugRemoteEnabled) {
        DLOGI("HB", "heap=%u frag=%u uptime=%lus mode=%d ntp=%d rssi=%d",
              ESP.getFreeHeap(), ESP.getHeapFragmentation(),
              millis() / 1000, (int)displayMode, ntpSynced ? 1 : 0,
              wifiConnected ? WiFi.RSSI() : 0);
      }
    }
  }

  // Update LED clock display
  displayClock();

  delay(100);
}
